[
    {
    "title": "A Comparison of Recurrent and Convolutional Deep Learning Architectures for EEG Seizure Forecasting",
    "authors": "S. Shafiezadeh , M. Pozza, A. Testolin.",
    "abstract": " Many research efforts are being spent to discover predictive markers of seizures, which would allow to build forecasting systems that could mitigate the risk of injuries and clinical complications in epileptic patients. Although electroencephalography (EEG) is the most widely used tool to monitor abnormal brain electrical activity, no commercial devices can reliably anticipate seizures from EEG signal analysis at present. Recent advances in Artificial Intelligence, particularly deep learning algorithms, show promise in enhancing EEG classifier forecasting accuracy by automatically extracting relevant spatio-temporal features from EEG recordings. In this study, we systematically compare the predictive accuracy of two leading deep learning architectures: recurrent models based on Long Short-Term Memory networks (LSTMs) and Convolutional Neural Networks (CNNs). To this aim, we consider a data set of long-term, continuous multi-channel EEG recordings collected from 29 epileptic patients",
    "doi": "10.5220/0012311800003657",
    "link": "https://www.scitepress.org/Link.aspx?doi=10.5220/0012311800003657",
    "venue": "Proceedings of the 17th International Joint Conference on Biomedical Engineering Systems and Technologies",
    "year": 2024,
    "bibtex": "@inproceedings{DBLP:conf/biostec/ShafiezadehPT24, author={Sina Shafiezadeh and Marco Pozza and Alberto Testolin}, title={A Comparison of Recurrent and Convolutional Deep Learning Architectures for EEG Seizure Forecasting}, year={2024}, cdate={1704067200000}, pages={583-590}, url={https://doi.org/10.5220/0012311800003657}, booktitle={BIOSTEC (1)}, crossref={conf/biostec/2024-1}}"
    },
    {
    "title": "A systematic review of cross-patient approaches for EEG epileptic seizure prediction",
    "authors": "S. Shafiezadeh , G.M. Duma, M. Pozza, A. Testolin.",
    "abstract": "Objective: Seizure prediction could greatly improve the quality of life of people suffering from epilepsy. Modern prediction systems leverage artificial intelligence (AI) techniques to automatically analyze neurophysiological data, most commonly the electroencephalogram (EEG), in order to anticipate upcoming epileptic events. However, the performance of these systems is normally assessed using randomized splitting methods, which can suffer from data leakage and thus result in an optimistic evaluation. In this review, we systematically surveyed the available scientific literature looking for research approaches that adopted more stringent assessment methods based on patient-independent testing. Approach: We queried three scientific databases (PubMed, Scopus, and Web of Science), focusing on AI techniques based on non-invasive EEG recorded from human subjects. We first summarize a standardized signal processing pipeline that could be deployed for the development and testing of cross-patient seizure prediction systems. We then analyze the research work that meets our selection criteria. Main results: 21 articles adopted patient-independent validation methods, constituting only 4% of the published work in the entire field of epileptic seizure prediction. Among eligible articles, the most common approach to deal with cross-patient scenarios was based on source domain adaptation techniques, which allow to fine-tune the predictive model on a limited set of data recorded from a set of independent target patients. Significance: Overall, our review indicates that epileptic seizure prediction remains an extremely challenging problem and significant research efforts are still needed to develop automated systems that can be deployed in realistic clinical settings. Our review protocol is based on the preferred reporting items for systematic review and meta-analysis protocols 2020 guidelines for conducting systematic reviews, considering NHLBI and ROBIS tools to mitigate the risk of bias, and it was pre-registered in PROSPERO (registration number: CRD4202452317).",
    "doi": "10.1088/1741-2552/ad9682",
    "link": "https://iopscience.iop.org/article/10.1088/1741-2552/ad9682",
    "venue": "Journal of Neural Engineering",
    "year": 2024,
    "bibtex": "@article{Shafiezadeh_2024, doi = {10.1088/1741-2552/ad9682}, url = {https://doi.org/10.1088/1741-2552/ad9682}, year = {2024}, month = {dec}, publisher = {IOP Publishing}, volume = {21}, number = {6}, pages = {061004}, author = {Shafiezadeh, Sina and Marco Duma, Gian, Pozza, Marco and Testolin, Alberto}, title = {A systematic review of cross-patient approaches for EEG epileptic seizure prediction}, journal = {Journal of Neural Engineering}, abstract = {Objective: Seizure prediction could greatly improve the quality of life of people suffering from epilepsy. Modern prediction systems leverage artificial intelligence (AI) techniques to automatically analyze neurophysiological data, most commonly the electroencephalogram (EEG), in order to anticipate upcoming epileptic events. However, the performance of these systems is normally assessed using randomized splitting methods, which can suffer from data leakage and thus result in an optimistic evaluation. In this review, we systematically surveyed the available scientific literature looking for research approaches that adopted more stringent assessment methods based on patient-independent testing. Approach: We queried three scientific databases (PubMed, Scopus, and Web of Science), focusing on AI techniques based on non-invasive EEG recorded from human subjects. We first summarize a standardized signal processing pipeline that could be deployed for the development and testing of cross-patient seizure prediction systems. We then analyze the research work that meets our selection criteria. Main results: 21 articles adopted patient-independent validation methods, constituting only 4% of the published work in the entire field of epileptic seizure prediction. Among eligible articles, the most common approach to deal with cross-patient scenarios was based on source domain adaptation techniques, which allow to fine-tune the predictive model on a limited set of data recorded from a set of independent target patients. Significance: Overall, our review indicates that epileptic seizure prediction remains an extremely challenging problem and significant research efforts are still needed to develop automated systems that can be deployed in realistic clinical settings. Our review protocol is based on the preferred reporting items for systematic review and meta-analysis protocols 2020 guidelines for conducting systematic reviews, considering NHLBI and ROBIS tools to mitigate the risk of bias, and it was pre-registered in PROSPERO (registration number: CRD4202452317)}"
    }
]

