[
  {
  "year": "2025-Present",
  "title": "Collaboration on hvEEGNet Model",
  "subtitle": "University of Trieste - Dr. Cisotto",
  "description": "Evaluating novel EEG signal reconstruction model's robustness to noise and artifacts. Joint publication planned on performance and diagnostic applications.",
  "type": "collaboration"
  },
  {
    "year": "2024-Present",
    "title": "PhD in Brain, Mind, and Computer Science",
    "subtitle": "University of Padua × Fondazione Bruno Kessler (FBK)",
    "description": "Doctoral research on AI-driven prediction and management of chronic diseases, particularly COPD. Developing digital health tools combining machine learning, human-centered design, and psychological insights.",
    "type": "position"
  },
  {
    "year": "2024",
    "title": "AI Researcher Assistant ",
    "subtitle": "University of Padua",
    "description": "Conducted a comprehensive systematic review of AI-based seizure forecasting systems, focusing on patient-independent testing to rigorously evaluate existing approaches and identify key challenges and opportunities for future research.",
     "type": "collaboration"
  },
  {
    "year": "2024",
    "title": "AI Researcher in Generative AI and NLP",
    "subtitle": "University Ca'Foscari - Venice",
    "description": "Developing innovative AI solutions focused on enhancing knowledge management and information retrieval, my recent work culminated in a Retrieval Augmented Generation (RAG) system that efficiently extracts and synthesizes information from large datasets to streamline decision-making processes.",
    "type": "position"
  },
  {
    "year": "2019-2023",
    "title": "M.Sc. in Artificial Intelligence",
    "subtitle": "University of Padua",
    "description": "Specialized in machine learning and neural networks with focus on healthcare applications. Thesis on forecasting epileptic seizures from electroencephalograms using Deep Neural Networks.",
    "type": "education"
  },
  {
  "year": "2014-2020",
  "title": "Foundation in Computer Science, Software Development, and AI",
  "subtitle": "University of Padua and various work/internship experiences",
  "description": "Established a solid foundation in core Computer Science principles, including the Bachelor's degree in Computer Science (2014-2018). Gained practical experience in Full-stack software development (2018-2020) and specialized through an AI Engineer internship focused on anomaly detection and face re-identification using Python and CNNs (2020). Also developed identity and access management prototypes using Blockchain technologies and various programming languages as a Junior Software Developer.",
  "type": "summary"
  }
]
